taskt/Core/Automation/Commands/JSONGroup/IJSONValueActionProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IJSONValueActionProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands" [ label="AJSONAddInsertSetJContainerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IJSONValueActionProperties" [ label="IJSONValueActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONValueActionCommands" [ label="AJSONValueActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands" [ label="AJSONInsertValueToJContainerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands" [ label="AJSONSetValueOfJContainerCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AddJSONArrayItemCommand" [ label="AddJSONArrayItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AddJSONObjectPropertyCommand" [ label="AddJSONObjectPropertyCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetJSONValueCommand" [ label="SetJSONValueCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CreateJSONVariableCommand" [ label="CreateJSONVariableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.InsertJSONArrayItemCommand" [ label="InsertJSONArrayItemCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.InsertJSONObjectPropertyCommand" [ label="InsertJSONObjectPropertyCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetJSONValueOfJSONArrayCommand" [ label="SetJSONValueOfJSONArrayCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetJSONValueOfJSONObjectCommand" [ label="SetJSONValueOfJSONObjectCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands" -> "taskt.Core.Automation.Commands.IJSONValueActionProperties";
"taskt.Core.Automation.Commands.AJSONValueActionCommands" -> "taskt.Core.Automation.Commands.IJSONValueActionProperties";
"taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.AddJSONArrayItemCommand" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.AddJSONObjectPropertyCommand" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.SetJSONValueCommand" -> "taskt.Core.Automation.Commands.AJSONAddInsertSetJContainerCommands";
"taskt.Core.Automation.Commands.CreateJSONVariableCommand" -> "taskt.Core.Automation.Commands.AJSONValueActionCommands";
"taskt.Core.Automation.Commands.InsertJSONArrayItemCommand" -> "taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands";
"taskt.Core.Automation.Commands.InsertJSONObjectPropertyCommand" -> "taskt.Core.Automation.Commands.AJSONInsertValueToJContainerCommands";
"taskt.Core.Automation.Commands.SetJSONValueOfJSONArrayCommand" -> "taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands";
"taskt.Core.Automation.Commands.SetJSONValueOfJSONObjectCommand" -> "taskt.Core.Automation.Commands.AJSONSetValueOfJContainerCommands";
}
